org/new/GMarin_CV.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-25 Mon 20:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="outline-container-org2393cbf" class="outline-2">
<h2 id="org2393cbf"><i>Gabriel Marin</i></h2>
<div class="outline-text-2" id="text-org2393cbf">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">email</td>
<td class="org-left"><a href="mailto:gbrlmarn@proton.me">gbrlmarn@proton.me</a></td>
</tr>

<tr>
<td class="org-left">github</td>
<td class="org-left"><a href="https://github.com/gbrlmarn">github.com/gbrlmarn</a></td>
</tr>

<tr>
<td class="org-left">site</td>
<td class="org-left"><a href="https://gbrlmarn.github.io">gbrlmarn.github.io</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6d73059" class="outline-2">
<h2 id="org6d73059">About me</h2>
<div class="outline-text-2" id="text-org6d73059">
<p>
I'm a <b>software engineer</b> with a background in networking and 
programming, passionate about open source software, 
command line applications, programming languages, 
distributed computing and operating systems.
My mission is to contribute to the development of future 
software infrastructure.
</p>
</div>
</div>

<div id="outline-container-org293dd44" class="outline-2">
<h2 id="org293dd44">Programming Languages</h2>
<div class="outline-text-2" id="text-org293dd44">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Proficient</td>
<td class="org-left">C/C++, Scheme, Python, Clojure,</td>
</tr>

<tr>
<td class="org-left">Competent</td>
<td class="org-left">JavaScript, Java, Common Lisp, Rust, Go,</td>
</tr>

<tr>
<td class="org-left">Beginner</td>
<td class="org-left">PowerShell, Bash, Perl, Elixir, Erlang.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1ce9451" class="outline-2">
<h2 id="org1ce9451">Tools &amp; Libraries</h2>
<div class="outline-text-2" id="text-org1ce9451">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Proficient</td>
<td class="org-left">Linux, Networking, <i>Emacs</i>, Org, Vim, Git, Tmux,</td>
</tr>

<tr>
<td class="org-left">Competent</td>
<td class="org-left">Docker, Make, Leiningen, Guix</td>
</tr>

<tr>
<td class="org-left">Beginner</td>
<td class="org-left">HTML/CSS, Django, React, LaTeX, PlantUML</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgafdee6f" class="outline-2">
<h2 id="orgafdee6f">Languages</h2>
<div class="outline-text-2" id="text-orgafdee6f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Native</td>
<td class="org-left">Romanian</td>
</tr>

<tr>
<td class="org-left">Expert</td>
<td class="org-left">English</td>
</tr>

<tr>
<td class="org-left">Beginner</td>
<td class="org-left">Italian, French</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4a333ab" class="outline-2">
<h2 id="org4a333ab">Employment</h2>
<div class="outline-text-2" id="text-org4a333ab">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2022-Current</td>
<td class="org-left"><b>Software Engineer at Luxoft, Bucharest</b></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Done socket programming using ZeroMQ library in C/C++.</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Automated environment configuration using Docker and Bash.</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Prototyped integration tests using Golang and Clojure.</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Developed command line interface for sending/receiving messages.</td>
</tr>

<tr>
<td class="org-right">2021-2022</td>
<td class="org-left"><b>Software Engineer at Continental, Sibiu</b></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Worked on code generator, parsing XML and Json with Java and Python.</td>
</tr>

<tr>
<td class="org-right">2019-2021</td>
<td class="org-left"><b>System Engineer at Ministry of Internal Affairs, Rm.Valcea</b></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Developed scripts for task automation with PowerShell.</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Deployed and configured Radius server and Squid proxy.</td>
</tr>

<tr>
<td class="org-right">2018-2019</td>
<td class="org-left"><b>Middleware Engineer at Ministry of Internal Affairs, Bucharest</b></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Provided layer 1 support.</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Managed users access in Oracle SQL databse.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfc8dd85" class="outline-2">
<h2 id="orgfc8dd85">Education</h2>
<div class="outline-text-2" id="text-orgfc8dd85">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2018-2020</td>
<td class="org-left">Master's in Telecommunications Engineering at</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Military Technical Academy, Bucharest</td>
</tr>

<tr>
<td class="org-right">2014-2018</td>
<td class="org-left">Bachelor's in Telecommunications Engineering at</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Military Technical Academy, Bucharest</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:gbrlmarn@nest">gbrlmarn@nest</a></p>
<p class="date">Created: 2023-09-25 Mon 20:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
