new/GMarin_CV.tex
% Created 2023-09-25 Mon 20:49
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\pagenumbering{gobble}
\usepackage[defaultsans]{opensans}
\usepackage[T1]{fontenc}
\usepackage[big]{layaureo} %better A4 formating
\usepackage{titlesec} %custom \section
\usepackage{url,parskip} %packages for formating
\usepackage{multicol} % multiples columns
\usepackage{ragged2e} % for alignment
\usepackage{color}
\usepackage{graphicx}
\usepackage{svg}
\usepackage{hyperref}
\definecolor{linkcolour}{rgb}{0,0.2,0.6}
\hypersetup{colorlinks,breaklinks,urlcolor=linkcolour, linkcolor=linkcolour}
\titleformat{\section}{\large\scshape\raggedright}{}{0em}{}[\titlerule]
\titlespacing{\section}{0pt}{4pt}{4pt}
\setlength{\columnsep}{1cm} % space between columns
\titleformat{\subsection}{\normalsize\scshape\raggedright}{}{0em}{}
\author{gbrlmarn@nest}
\date{}
\title{}
\hypersetup{
 pdfauthor={gbrlmarn},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\section*{\textbf{\emph{(Gabriel Marin)}}}
\label{sec:orge6739c7}
\begin{center}
\begin{tabular}{{p{2.5cm}p{13cm}}}
Email & \href{mailto:gbrlmarn@proton.me}{gbrlmarn@proton.me}\\
Github & \href{https://github.com/gbrlmarn}{github.com/gbrlmarn}\\
Site & \href{https://gbrlmarn.github.io}{gbrlmarn.github.io}\\
\end{tabular}
\end{center}
\section*{About me}
\label{sec:orgd9ee743}
I'm a \textbf{software engineer} with a background in networking and 
programming, passionate about open source software, 
command line applications, programming languages, 
distributed computing and operating systems.
My mission is to contribute to the development of future 
software infrastructure.

\section*{Programming Languages}
\label{sec:orgf85f461}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
Proficient & C/C++, Clojure\\
Competent & Go, Scheme, Common Lisp, Python, Java, JavaScript\\
Beginner & PowerShell, Shell, Perl, Elixir, Erlang\\
\end{tabular}
\end{center}
\section*{Tools \& Libraries}
\label{sec:orgb96ed6b}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
Proficient & Linux, Networking, \emph{Emacs}, Org, Vim, Git, Tmux,\\
Competent & Docker, Make, Leiningen, Guix\\
Beginner & HTML/CSS, Django, React, \LaTeX{}, PlantUML\\
\end{tabular}
\end{center}
\section*{Languages}
\label{sec:org9a5834f}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
Native & Romanian\\
Expert & English\\
Beginner & Italian, French\\
\end{tabular}
\end{center}
\section*{Employment}
\label{sec:org2887d23}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
2022-Current & \textbf{Software Engineer at Luxoft, Bucharest}\\
 & Done socket programming using ZeroMQ library in C/C++.\\
 & Automated environment configuration using Docker and Bash.\\
 & Prototyped integration tests using Golang and Clojure.\\
 & Developed command line interface for sending/receiving messages.\\
2021-2022 & \textbf{Software Engineer at Continental, Sibiu}\\
 & Worked on code generator, parsing XML and Json with Java and Python.\\
2019-2021 & \textbf{System Engineer at Ministry of Internal Affairs, Rm.Valcea}\\
 & Developed scripts for task automation with PowerShell.\\
 & Deployed and configured Radius server and Squid proxy.\\
2018-2019 & \textbf{Middleware Engineer at Ministry of Internal Affairs, Bucharest}\\
 & Provided layer 1 support.\\
 & Managed users access in Oracle SQL databse.\\
\end{tabular}
\end{center}

\section*{Education}
\label{sec:orgb56f6b3}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
2018-2020 & Master's in Telecommunications Engineering at\\
 & Military Technical Academy, Bucharest\\
2014-2018 & Bachelor's in Telecommunications Engineering at\\
 & Military Technical Academy, Bucharest\\
\end{tabular}
\end{center}
\end{document}
